{
    "0": "The Battle of Yavin, also known as the Battle of the Death Star or the Miracle of Yavin, was a major and decisive battle of the Galactic Civil War, in which the Rebel Alliance was able to destroy the Death Star and was seen as one of the first major victories over the Galactic Empire.",
    "1": "Star Wars: Episode I The Phantom Menace is a 1999 film written and directed by George Lucas, produced by Rick McCallum and starring Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd, and Ian McDiarmid. It is the first chapter of the Star Wars prequel trilogy, the fourth theatrical Star Wars release overall, and chronologically the first film in the Star Wars saga. The Phantom Menace was released in theaters on May 19, 1999, becoming the first Star Wars film since Star Wars: Episode VI Return of the Jedi, which was released sixteen years earlier. The release was accompanied by extensive media coverage and great fan anticipation. Despite mixed reviews from critics and fans, the film grossed $924.3 million worldwide, making it the second-highest-grossing Star Wars film when unadjusted for inflation. It was released on Blu-ray in September 2011, and was re-released in theaters in 3D on February 10, 2012.",
    "2": "Star Wars: Episode II Attack of the Clones is a 2002 film directed by George Lucas & written by Lucas and Jonathan Hales. It is the second part of the Star Wars prequel trilogy. The film is set ten years after the Battle of Naboo, when the galaxy is on the brink of civil war. Under the leadership of renegade Jedi Master Count Dooku, thousands of systems threaten to secede from the Republic. When an assassination attempt is made on Senator Padmé Amidala, the former Queen of Naboo, Jedi apprentice Anakin Skywalker is assigned to protect her. In contrast, his mentor Obi-Wan Kenobi is assigned to investigate the assassination attempt. Soon, the Jedi are drawn into the heart of the Separatist movement, and the beginning of a new threat to the galaxy: the Clone Wars.",
    "3": "Star Wars: Episode III Revenge of the Sith is a 2005 film written and directed by George Lucas. It is the third and final part of the Star Wars prequel trilogy. Three years after the First Battle of Geonosis and onset of the Clone Wars, the noble Jedi Knights of the Jedi Order have been leading a massive clone army into a galaxy-wide battle against the Confederacy of Independent Systems. The Supreme Chancellor of the Galactic Republic reveals his true nature as a Sith Lord as he unveils a plot to rule the galaxy by transforming the Republic into a Galactic Empire. The Jedi war hero, Anakin Skywalker, is seduced by the dark side of the Force to become Darth Sidious's new apprentice - Darth Vader. The Jedi are all but eliminated with Obi-Wan Kenobi and Jedi Master Yoda surviving the event and forced into hiding. The only hope for the galaxy is Anakin's own offsprings — the twin children born in secrecy who will grow up to become Luke Skywalker and Leia Organa.",
    "4": "Star Wars: Episode IV A New Hope, originally released as Star Wars, is a 1977 film written and directed by George Lucas. It is the first part of the Star Wars original trilogy and the first Star Wars film released. The film is set 19 years after the formation of the Galactic Empire and the events of Revenge of the Sith; construction has finished on the Death Star, a weapon capable of destroying a planet. After Princess Leia Organa, a leader of the Rebel Alliance, receives the weapon's plans in the hope of finding a weakness, she is kidnapped and taken to the Death Star. Meanwhile, a young farmer named Luke Skywalker meets Obi-Wan Kenobi, who has lived in seclusion for years on the desert planet of Tatooine. When Luke's home is burned and his aunt and uncle killed, Obi-Wan begins Luke's Jedi training as they—along with Han Solo, Chewbacca, C-3PO, and R2-D2 attempt to rescue the princess from the Empire.",
    "5": "Star Wars: Episode V The Empire Strikes Back, marketed as simply The Empire Strikes Back, is a 1980 film directed by Irvin Kershner and written by Leigh Brackett and Lawrence Kasdan from a story by George Lucas. It is the second part of the Star Wars original trilogy. The film concerns the continuing struggles of the Rebel Alliance against the Galactic Empire. During the film, Han Solo, Chewbacca, and Princess Leia Organa are being pursued across space by Darth Vader and his elite forces. Meanwhile, Luke Skywalker begins his major Jedi training with Yoda, after an instruction from Obi-Wan Kenobi's spirit. In an emotional and near-fatal confrontation with Vader, Luke is presented with a horrific revelation and must face his destiny.",
    "6": "Star Wars: Episode VI Return of the Jedi, marketed as simply Return of the Jedi, is a 1983 film directed by Richard Marquand and written by Lawrence Kasdan and George Lucas from a story by Lucas. It is the third and final installment of the Star Wars original trilogy. Luke Skywalker and friends travel to Tatooine to rescue their companion Han Solo from the vile Jabba the Hutt. The Empire prepares to crush the Rebellion with a more powerful Death Star, while the Rebel fleet mounts a massive attack on the space station. Luke confronts his father, Darth Vader, in a final climactic duel before the evil Emperor.",
    "7": "Star Wars: Episode VII The Force Awakens, marketed as Star Wars: The Force Awakens, is a 2015 film directed by J.J. Abrams; co-written by Abrams, Lawrence Kasdan, and Michael Arndt; and produced by Lucasfilm president Kathleen Kennedy and Bad Robot Productions. It is the first part of the Star Wars sequel trilogy. The film stars Harrison Ford, Mark Hamill, Carrie Fisher, Anthony Daniels, and Peter Mayhew reprising their original roles. The original actors are joined by a host of new actors including Daisy Ridley, John Boyega, Adam Driver, and Oscar Isaac. The story begins thirty years after the events of Star Wars: Episode VI Return of the Jedi. The First Order has risen from the ashes of the Galactic Empire and is opposed by General Leia Organa and the Resistance, both of which seek to find the missing Jedi Master Luke Skywalker. In the midst of this search, new heroes rise in the form of Rey, a 19 year-old girl and a Force-sensitive scavenger from Jakku; Finn, a stormtrooper who defected from the First Order; and Poe Dameron, the best pilot in the Resistance. They are aided by Han Solo in their search for Skywalker and their mission to destroy the First Order's new superweapon, Starkiller Base, which targets the New Republic and the Resistance for destruction. They are opposed by villains such as Kylo Ren, a dark warrior with a mysterious past; and General Armitage Hux, the commander of Starkiller Base.",
    "8": "Star Wars: Episode VIII The Last Jedi, marketed as Star Wars: The Last Jedi, is a 2017 film written and directed by Rian Johnson and produced by Kathleen Kennedy and Ram Bergman, along with executive producer J.J. Abrams. It is the second part of the Star Wars sequel trilogy. The film sees the return of Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Lupita Nyong'o, Domhnall Gleeson, Anthony Daniels, Gwendoline Christie, and Andy Serkis. New cast members include Benicio Del Toro, Laura Dern, and Kelly Marie Tran. The Last Jedi begins immediately after the events of Star Wars: Episode VII The Force Awakens, set thirty years after the conclusion of the original Star Wars trilogy. It continues the story of Rey and her discovery of the exiled Jedi Master Luke Skywalker, along with the story of the war between General Leia Organa's Resistance and the First Order.",
    "9": "Star Wars: Episode IX The Rise of Skywalker, marketed as Star Wars: The Rise of Skywalker, is a 2019 film directed by J.J. Abrams from a script by Abrams and Chris Terrio. It is the third and final part of the Star Wars sequel trilogy. The film, produced by Lucasfilm president Kathleen Kennedy, is a continuation of 2015's The Force Awakens, which Abrams also directed and co-wrote, and 2017's The Last Jedi. Lucasfilm has referred to The Rise of Skywalker as the ninth and final installment of the Skywalker saga. The film stars Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, with Ian McDiarmid and Billy Dee Williams. Fisher, who passed away in 2016 prior to the film's production, appeared via unused footage from The Force Awakens. The film was first announced after The Walt Disney Company acquired Lucasfilm Ltd. in 2012. Colin Trevorrow was initially announced as the director and writer of the film, but he and Lucasfilm parted ways in September 2017, with Lucasfilm citing creative differences over the project. On September 12, 2017, Abrams and Terrio were announced as the new director and writers.",
    "10": "Star Wars: The Clone Wars is an animated television series set between the events of Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith. The series aired on Cartoon Network for five seasons from 2008 to 2013, while an abridged sixth season was released through Netflix in 2014. The final, seventh season was released on Disney+ in 2020.",
    "11": "Star Wars: The Bad Batch is an animated television series that acts as both a sequel to and a spin-off of Star Wars: The Clone Wars. It focuses on the squad known as Clone Force 99, a band of genetically enhanced clone troopers. It was announced on July 13, 2020 and premiered on Disney+ on May 4, 2021. The first season has sixteen episodes, and its musical score was composed by Kevin Kiner, who previously worked on Star Wars: The Clone Wars and Star Wars Rebels.",
    "12": "Star Wars Rebels is an animated television series set during the time frame between the films Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope. It premiered worldwide as a one-hour television movie, Star Wars Rebels: Spark of Rebellion, on Disney Channel on October 3, 2014; Regular episodes aired for four seasons on Disney XD, from October 13, 2014 to March 5, 2018. During its run, the series was nominated for four Emmy Awards, including two consecutive nominations for 'Outstanding Children's Program.' The series follows a motley group of rebels who live aboard the starship Ghost as they fight the Galactic Empire. The rebels include Ezra Bridger, a young orphan from Lothal who learns he can use the Force; Kanan Jarrus, a Jedi who survived Order 66; Hera Syndulla, a Twi'lek pilot and veteran resistance fighter; Sabine Wren, a Mandalorian explosives expert; Garazeb 'Zeb' Orrelios, a Lasat warrior; and the cantankerous astromech droid C1-10P, also known as Chopper. The crew will eventually help give rise to the Rebel Alliance.",
    "13": "The Mandalorian, alternatively titled as Star Wars: The Mandalorian, is a live-action space western Star Wars television series developed by Lucasfilm. The series takes place about five years after the events of the 1983 film Star Wars: Episode VI Return of the Jedi and about twenty-five years before the events of the 2015 film Star Wars: Episode VII The Force Awakens and airs exclusively on Disney's streaming service, Disney+, which launched on November 12, 2019. Jon Favreau is the creator, writer, and executive producer of the series. Directors include Dave Filoni, Deborah Chow, Rick Famuyiwa, Bryce Dallas Howard, and Taika Waititi.",
    "14": "The Book of Boba Fett, marketed as Star Wars: The Book of Boba Fett, is a live-action television series that focuses on the character Boba Fett taking place after the events of the second season of The Mandalorian but before the events of the third season of The Mandalorian. Its first episode was released on December 29, 2021. It was first teased, with both its title and release window, in a post-credits sequence of the season two finale of The Mandalorian.",
    "15": "Obi-Wan Kenobi, marketed as Star Wars: Obi-Wan Kenobi, is a live-action television miniseries developed by Lucasfilm. It premiered on Disney+ on May 26, 2022 and concluded on June 22, 2022. The series features Ewan McGregor and Hayden Christensen reprising their roles from the Star Wars prequel trilogy, respectively Obi-Wan Kenobi and Darth Vader. It takes place ten years after Star Wars: Episode III Revenge of the Sith.",
    "16": "Star Wars: Clone Wars is an animated television micro-series that chronicles the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Produced by Cartoon Network Studios, the series originally aired from 2003 to 2005, and was intended to serve as a bridge between the films Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith. The series consists of twenty-five chapters; Seasons 1 and 2 (Volume I) are made up of three-minute installments, while Season 3 (Volume II) is made up of twelve-to-fifteen minute installments. The success of Star Wars: Clone Wars led to production of the similarly titled Star Wars: The Clone Wars.",
    "17": "Andor, titled as Star Wars: Andor on Disney+, is an American television series developed by Lucasfilm. It currently airs on Disney's online streaming service. The series is a spy thriller starring Diego Luna, reprising his role as Cassian Andor from the film, Rogue One: A Star Wars Story.",
    "18": "Ahsoka, also named Star Wars: Ahsoka, is a live-action television series that was first announced on December 10, 2020. Its first season streamed exclusively on Disney+ in 2023. It is written by Dave Filoni and produced by him and Jon Favreau and stars Rosario Dawson as Ahsoka Tano. It is set in 9 ABY after Ahsoka Tano's appearance in The Mandalorian season two and follows her search for Imperial Grand Admiral Thrawn started in the epilogue of the animated series Star Wars Rebels. A second season was announced on January 9, 2024 and the series' story will be concluded by an upcoming untitled film directed by Filoni.",
    "19": "The Senate held an emergency session at the Chancellor's request. Sidious publicly denounced the Jedi Order; he accused them of plotting to assassinate him in order to take control of the Senate, and by extension, the Republic. Meanwhile, Vader undertook a mission to Mustafar where he personally executed the Separatist Council, at the behest of Sidious who betrayed and no longer needed them. With the Great Jedi Purge in effect, and the Separatists neutralized, Sidious proclaimed himself Galactic Emperor. The Galactic Republic officially became the Galactic Empire, and democracy was supplanted by the fascist New Order. While many senators cheered and applauded the birth of the Empire, Amidala and Organa quietly lamented the Republic's end. Vader deactivated the droid army soon after killing the Separatist leaders on Mustafar. The Clone Wars was over, and its conclusion marked the dawn of the Imperial Era.",
    "20": "The Galactic Empire, also known as the First Galactic Empire and simply as the Empire and later as the Old Empire, was the dictatorship that replaced the Galactic Republic at the end of the Clone Wars. Though the Empire rose to power by promising to bring order to the galaxy, it oversaw a period of harsh military rule and aggressive expansion. The subsequent Imperial Era would last only two decades, for it was eventually overthrown by the Alliance to Restore the Republic in the Galactic Civil War, but not before the sovereign star systems of the galaxy had been largely conquered and oppressed by the Empire's forces.",
    "21": "The Old Republic was restored in the form of the modern Galactic Republic in 1032 BBY. After the Galactic Republic's reformation, the Zygerrians would continue to hold a grudge against both the Republic and the Jedi Order for the destruction of their slave empire. The modern Republic was a democratic union that consisted of multiple star systems spread across the galaxy. With the exception of small-scale conflicts that the Jedi dealt with, the Republic Era was an age of peace and stability that lasted for over a millennium. This version of the Republic existed in a demilitarized state for most of its history as such, the government relied on the Jedi Knights, who upheld their mandate as the guardians of peace and justice.",
    "22": "After the assassination of Tai-Lin Garr, Lady Carise and her Centrist counterparts began preparing a motion to secede from the New Republic in order to join and support the First Order. Acting as a political coalition of worlds advocating centralized authority, star systems aligned with the Centrists—including the planets Arkanis, Orinda, and Kuat—formally withdrew from the New Republic and joined the First Order in 29 ABY, marking the official formation of the First Order as a regime and beginning the Cold War between the First Order and the New Republic. While some in the Galactic Senate applauded the notion, others realized that without New Republic supervision, the former Imperials would return to the draconian ways of their predecessors. Supreme Leader Snoke initiated a vast rearmament program, which would go on to produce a technologically superior military over the one that once existed under the Galactic Empire, and began subverting the Republic, as the First Order was keenly aware that it lacked the superior numbers and support of the former Imperial state.",
    "23": "The First Order, or simply the Order, was a fascist military junta in the Unknown Regions of the galaxy during the era of the New Republic. The First Order was ruled by a Supreme Leader from their mobile headquarters instead of a traditional planetary capital. A militaristic dictatorship that wished to remove disorder from existence and had a fanatical devotion to the totalitarian notions of order and a disdain for democracy. To this end, it became locked in a Cold War with the New Republic and spreading influence from beyond the confines of unknown space, ending with the First Order staging an invasion of the galaxy, but were repelled by the Resistance and Jedi Order, causing First Order rule to crumble.",
    "24": "The Sith Empire, later known as the Old Sith Empire or Original Sith Empire, was a wealthy and powerful empire in the Outer Rim established by Dark Jedi who were banished from the Galactic Republic after their defeat at the Battle of Corbos at the end of the Hundred-Year Darkness.",
    "25": "The Rule of Two was a decree for the Sith established by Sith Lord Darth Bane so they could operate in secret and eventually get revenge on the Jedi Order for their near extinction in the Jedi-Sith War. It was the successor of the Doctrine of the Dyad, a concept centered on the Force dyad, which was a pairing of two Force-sensitive beings linked by a unique Force-bond that was unbreakable. The decree commanded that only two Sith Lords must exist at any given time: a master to represent the power of the dark side of the Force, and an apprentice to crave it and train under the master and to one day fulfill their role. This governed the Lords of the Sith.",
    "26": "The Galactic Republic, also known as the Grand Republic or simply as the Republic, was a democratic federal union spread across light-years of space. Old Republic and first Galactic Republic were terms affixed to the pre-modern Republic that existed until 1032 BBY, with the Old Republic also referring to the modern Republic that was supplanted by the Galactic Empire in 19 BBY. In addition, the term High Republic denoted the era in which the Republic reached the zenith of its power, lasting from around 500 BBY to around 100 BBY. The Republic was founded many millennia before the Battle of Yavin, approximately 25,000 BBY, around the same time as the Jedi Order. The Galactic Senate governed the Republic under the Galactic Constitution, and comprised thousands of senators representing the Republic's member worlds. The Supreme Chancellor was the title of the head of the Republic, elected from ranks of the Senate to lead the government on Coruscant. An ecumenopolis or city-covered planet, referred to as Galactic City, Coruscant was the capital of the Republic and therefore the seat of the Senate.",
    "27": "The Infinite Empire, also known as the Rakatan Empire, or the Rakata Empire, was a galaxy spanning empire in the galaxy ruled by the Rakata, an advanced species from the planet Lehon in the Unknown Regions that used their knowledge to conquer and enslave other species throughout the galaxy, until its collapse in 25,200 BBY after a civil war, paving the way for the formation of the Galactic Republic within several short centuries.",
    "28": "The Sith Empire had renewed its war with the Galactic Republic. During this war, many Sith sought power within the Empire and began infighting among themselves. Darth Baras, having recently, ascended to the Dark Council, claimed that he was the Voice of the Emperor, host of the Sith Emperor's spirit, and had in fact trapped the real Voice on Voss. Baras was nearly successful but fellow Dark Council member Darth Vowrawn did not believe him and so Baras tried to kill him. The Sith Emperor, through the Emperor's Hand, declared Baras' former apprentice his new Wrath and put him on the path to destroy Baras. The Wrath saved Vowrawn, who was leading the campaign on Corellia, and with latter's help defeated Baras in sight of the Dark Council and was officially declared as the Emperor's Wrath and now the Dark Council acknowledged it and soon passed the information to the rest of the Empire. Darth Thanaton, another Dark Council member, was facing a similar dilemma from Lord Kallig, descendant of Alloysius Kallig. Sometime after Baras' coup, Darth Thanaton had declared a Kaggath against Kallig but he later fled in order to seek assistance from the Dark Council. The Dark Council was astonished that one of its own members was incapable of defeating a mere Lord so they decided to let Kallig challenge Thanaton. Darth Thanaton was defeated by Kallig and Darth Mortis of the Dark Council executed Thanaton. Darth Marr and the rest of the Dark Council gave Thanaton's seat to Kallig and so Kallig was named Darth Nox (Or, according to some, Darth Imperius). These are only a few examples of the fragmentation and infighting in the Empire. There was much more, as was common in Sith tradition. Eventually, this led to the Empire growing weak and lacking unification, as Darth Marr confesses on Makeb.",
    "29": "The Republic Dark Age was the term given to the last century of the New Sith Wars, from around 1100 BBY to the Ruusan Reformation of 1000 BBY. During the Dark Age, the Galactic Republic, in the eyes of later centuries, had essentially ceased to exist.",
    "30": "The Ruusan Reformation was an event that restructured the entire Galactic Republic following the New Sith Wars, taking power away from the Supreme Chancellor and reinvesting it in the Galactic Senate.",
    "31": "The Kwa were an ancient species native to the Outer Rim world of Dathomir that built the Infinity Gates and Star Temples during the Pre-Republic era. The Infinity Gates were permanent structures capable of enabling instantaneous travel between interstellar locations and were housed within the Star Temples. ",
    "32": "The Clone Wars (22-19 BBY) was a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems, which had seceded from the Republic. Also referred to as the Clone War, it was named after the clone troopers used by the Grand Army of the Republic against the Separatist Droid Army. Due to the high volume of battle droids deployed in the conflict, the war would also be known as the Droid War. Furthermore, the existence of the Confederacy granted the conflict yet another name, the Separatist War. With both clones and droids being fielded in enormous numbers by each respective side, they were the largest military forces in galactic history, and fighting between them swept through the galaxy for three, nearly four, years.",
    "33": "The New Sith Wars, also known to the Sith as The War of the Fittest,The Betrayal, and The Curse of Qalydon, was the name given to the thousand years of conflict between the Jedi and the New Sith, which lasted from approximately 2000 to 1000 BBY. As an era, the New Sith Wars were characterized by a spectacular rise of the Sith, the decline of the Galactic Republic, and a growing militancy in the Jedi Order. The balance between the Sith and the Republic fluctuated during the period, and at several periods, especially after the pivotal Battle of Mizra, the Republic was in danger of being overwhelmed completely.",
    "34": "The Great Hyperspace War was a conflict between the Galactic Republic and Sith Empire that took place just over 5,000 years before the Imperial Era spurred by the development of the hyperdrive and the faster-than-light travel. By the Imperial Era, the now-mythological conflict was recounted in the quasi-historical Qel-Droma Epics. The Great Sith Wars began around the same time.",
    "35": "The Great Galactic War, known as the Great War or Republic-Sith War, was a twenty eight-year-long galactic war between the Galactic Republic and Sith Empire between 3681 BBY and 3653 BBY. The war was the culmination of a 1300-year grudge held by survivors of the original Sith Empire against the Republic for their defeat in the Great Hyperspace War.",
    "36": "The Battle of Exegol, also known as the raid on Exegol or the Sith Eternal uprising, was the decisive final battle in the war between the First Order and the Resistance in which the Resistance and the Citizens' Fleet defeated the Final Order, the Xyston-class Star Destroyer fleet built by the Sith Eternal. The Resistance's victory prevented the Star Destroyers from leaving Exegol to reinforce First Order forces and began an uprising against it across the galaxy. The battle was also the final battle of the ancient, millennia-long war between the Jedi and the Sith, ending in a decisive victory for the Jedi with the destruction of Darth Sidious and prevention of the Sith's return as a whole.",
    "37": "The individual became the first Jedi to ever use the Force. The Prime Jedi was also the founder of the Jedi Order, which they established on the planet Ahch-To around 25,025 BBY. The first Jedi Temple, which was located on Ahch-To, contained a mosaic of the Prime Jedi in a state of meditation and balance.",
    "38": "The Hundred-Year Darkness was a period of time that led to the formation of the Sith, who were once considered brothers in the Force with the Jedi Order. The birth of the Sith led to a number of wars over the course of galactic history.",
    "39": "Formed around 5000 BBY, the Sith were the ancient enemies of the Jedi Order who shared their name with a red-skinned species Established by a rogue Jedi during the Hundred-Year Darkness, the Sith sought further knowledge and power through learning the dark side of the Force. Eventually, this Jedi was able to amass a sizable following, all of whom adhered to this new philosophy that embraced the dark side. This schism in the Jedi Order led to a civil war where the Jedi and the newly-founded Sith Order, once brothers and sisters in the Force, fought against one another for power. The war ended in the defeat of the Sith, who fled from known space. Unbeknownst to the Jedi, however, the Sith settled on Korriban, a world of red sands that was later known as Moraband, where they rebuilt in secret and waited for another",
    "40": "Branding Windu's actions as treason, Palpatine declared the Jedi to be enemies of the Republic and sent Vader to oversee the siege of the Jedi Temple. As his new apprentice purged the Temple of its inhabitants, including the younglings, Sidious authorized his Clone Commanders to execute Order 66, thereby activating the biochips that programmed the clones to see the Jedi as traitors to the Republic. As a result, thousands of Jedi throughout the galaxy were betrayed and executed by their clones including Ki-Adi-Mundi on Mygeeto, Aayla Secura on Felucia, Plo Koon on Cato Neimoidia, Stass Allie on Saleucami, Depa Billaba on Kaller, and Jaro Tapal above Bracca. Out of an estimated number of ten-thousand Jedi, just a few survived to see the proclamation of the New Order, marking the inception of the Galactic Empire and the rise of Palpatine as its Emperor.",
    "41": "The hyperspace tractor beam was developed as a primitive form of hyperdrive. It was an advancement to standard hyperdrives in use at the time, which required extraordinary amounts of physical space and power, and were too large to fit on smaller ships. The hyperspace tractor beam could move these smaller ships through hyperspace when they couldn't do so under their own power. The Celestials realized that such a device had great potential on a larger scale, and that the beam emitters could be enlarged enough to move bigger and bigger objects through hyperspace. Centerpoint Station was thereby constructed as an enormous hyperspace tractor beam large enough to move entire planets and stars. It was the only known such station, and used so much power that the Celestials had to move planets into orbit around it to provide power.",
    "42": "Though the Columi developed interstellar travel nearly 100,000 years before the Battle of Yavin, it is not known if they developed a true hyperdrive; what is known is that the fragile race soon gave up their interstellar travels to focus on other scientific and mental pursuits. The first interstellar space drive known to make use of hyperspace was developed by the Rakata, who built their Infinite Empire around technology using the dark side of the Force to travel through hyperspace.",
    "43": "The Force-drive was a type of hyperdrive that powered warships using the wells of Force energy existing within sentient slave species as fuel. Force-drives were installed aboard the Rakatan ships, where entire rooms were dedicated to the storage of slave fuel in vast containment racks. Each rack contained a number of 'tomblike shells', cells wherein the slaves were restrained face-down and hooked to a set of electrodes. Turned into living batteries, they were subjected to intense pain for extended periods of time, with the resultant dark-side energy extracted and channeled to the Force-drive. While this system did work, the Force-drive's reliance on the Force as its primarily power source gave it certain limitations, the most important of which was its inability to travel between any two arbitrary points in realspace. The Force-drive was only capable of targeting worlds with strong Force signatures, a fact which resulted in an empire that spanned the breadth of the galaxy but which only incorporated more than five hundred worlds. In addition, a powerful prisoner with a strong will could overcome the destructive effects of the mechanisms and break out of their cell.",
    "44": "Around 3636 BBY, the emerging Eternal Empire from Wild Space launched a campaign of conquest into the Core Worlds, defeating both the Galactic Republic and the Sith Empire, the known galaxy's major powers.",
    "45": "The New Empire was a short-lived Sith Empire established by the rogue Sith Lord Darth Malgus during the Galactic War between the reconstituted Sith Empire and the Galactic Republic. The new government was created due to disgust at the True Sith Empire's policies.",
    "46": "The Darksaber was an ancient and unique black-bladed lightsaber created by Tarre Vizsla, the first Mandalorian ever inducted into the Jedi Order, around 1050 BBY. The weapon was kept in the Jedi Temple after Vizsla's passing, but members of House Vizsla stole the saber in a conflict with the Jedi during the fall of the Old Republic. The Darksaber was passed down, generation to generation, by the ancestors of Pre Vizsla, who held onto the weapon even after the pacifist ideals of the New Mandalorians replaced the warrior ways of Mandalore."
  }