{
    "0": "The Battle of Yavin, also known as the Battle of the Death Star or the Miracle of Yavin, was a major and decisive battle of the Galactic Civil War, in which the Rebel Alliance was able to destroy the Death Star and was seen as one of the first major victories over the Galactic Empire.",
    "1": "Star Wars: Episode I The Phantom Menace is a 1999 film written and directed by George Lucas, produced by Rick McCallum and starring Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd, and Ian McDiarmid. It is the first chapter of the Star Wars prequel trilogy, the fourth theatrical Star Wars release overall, and chronologically the first film in the Star Wars saga. The Phantom Menace was released in theaters on May 19, 1999, becoming the first Star Wars film since Star Wars: Episode VI Return of the Jedi, which was released sixteen years earlier. The release was accompanied by extensive media coverage and great fan anticipation. Despite mixed reviews from critics and fans, the film grossed $924.3 million worldwide, making it the second-highest-grossing Star Wars film when unadjusted for inflation. It was released on Blu-ray in September 2011, and was re-released in theaters in 3D on February 10, 2012.",
    "2": "Star Wars: Episode II Attack of the Clones is a 2002 film directed by George Lucas & written by Lucas and Jonathan Hales. It is the second part of the Star Wars prequel trilogy. The film is set ten years after the Battle of Naboo, when the galaxy is on the brink of civil war. Under the leadership of renegade Jedi Master Count Dooku, thousands of systems threaten to secede from the Republic. When an assassination attempt is made on Senator Padmé Amidala, the former Queen of Naboo, Jedi apprentice Anakin Skywalker is assigned to protect her. In contrast, his mentor Obi-Wan Kenobi is assigned to investigate the assassination attempt. Soon, the Jedi are drawn into the heart of the Separatist movement, and the beginning of a new threat to the galaxy: the Clone Wars.",
    "3": "Star Wars: Episode III Revenge of the Sith is a 2005 film written and directed by George Lucas. It is the third and final part of the Star Wars prequel trilogy. Three years after the First Battle of Geonosis and onset of the Clone Wars, the noble Jedi Knights of the Jedi Order have been leading a massive clone army into a galaxy-wide battle against the Confederacy of Independent Systems. The Supreme Chancellor of the Galactic Republic reveals his true nature as a Sith Lord as he unveils a plot to rule the galaxy by transforming the Republic into a Galactic Empire. The Jedi war hero, Anakin Skywalker, is seduced by the dark side of the Force to become Darth Sidious's new apprentice - Darth Vader. The Jedi are all but eliminated with Obi-Wan Kenobi and Jedi Master Yoda surviving the event and forced into hiding. The only hope for the galaxy is Anakin's own offsprings — the twin children born in secrecy who will grow up to become Luke Skywalker and Leia Organa.",
    "4": "Star Wars: Episode IV A New Hope, originally released as Star Wars, is a 1977 film written and directed by George Lucas. It is the first part of the Star Wars original trilogy and the first Star Wars film released. The film is set 19 years after the formation of the Galactic Empire and the events of Revenge of the Sith; construction has finished on the Death Star, a weapon capable of destroying a planet. After Princess Leia Organa, a leader of the Rebel Alliance, receives the weapon's plans in the hope of finding a weakness, she is kidnapped and taken to the Death Star. Meanwhile, a young farmer named Luke Skywalker meets Obi-Wan Kenobi, who has lived in seclusion for years on the desert planet of Tatooine. When Luke's home is burned and his aunt and uncle killed, Obi-Wan begins Luke's Jedi training as they—along with Han Solo, Chewbacca, C-3PO, and R2-D2 attempt to rescue the princess from the Empire.",
    "5": "Star Wars: Episode V The Empire Strikes Back, marketed as simply The Empire Strikes Back, is a 1980 film directed by Irvin Kershner and written by Leigh Brackett and Lawrence Kasdan from a story by George Lucas. It is the second part of the Star Wars original trilogy. The film concerns the continuing struggles of the Rebel Alliance against the Galactic Empire. During the film, Han Solo, Chewbacca, and Princess Leia Organa are being pursued across space by Darth Vader and his elite forces. Meanwhile, Luke Skywalker begins his major Jedi training with Yoda, after an instruction from Obi-Wan Kenobi's spirit. In an emotional and near-fatal confrontation with Vader, Luke is presented with a horrific revelation and must face his destiny.",
    "6": "Star Wars: Episode VI Return of the Jedi, marketed as simply Return of the Jedi, is a 1983 film directed by Richard Marquand and written by Lawrence Kasdan and George Lucas from a story by Lucas. It is the third and final installment of the Star Wars original trilogy. Luke Skywalker and friends travel to Tatooine to rescue their companion Han Solo from the vile Jabba the Hutt. The Empire prepares to crush the Rebellion with a more powerful Death Star, while the Rebel fleet mounts a massive attack on the space station. Luke confronts his father, Darth Vader, in a final climactic duel before the evil Emperor.",
    "7": "Star Wars: Episode VII The Force Awakens, marketed as Star Wars: The Force Awakens, is a 2015 film directed by J.J. Abrams; co-written by Abrams, Lawrence Kasdan, and Michael Arndt; and produced by Lucasfilm president Kathleen Kennedy and Bad Robot Productions. It is the first part of the Star Wars sequel trilogy. The film stars Harrison Ford, Mark Hamill, Carrie Fisher, Anthony Daniels, and Peter Mayhew reprising their original roles. The original actors are joined by a host of new actors including Daisy Ridley, John Boyega, Adam Driver, and Oscar Isaac. The story begins thirty years after the events of Star Wars: Episode VI Return of the Jedi. The First Order has risen from the ashes of the Galactic Empire and is opposed by General Leia Organa and the Resistance, both of which seek to find the missing Jedi Master Luke Skywalker. In the midst of this search, new heroes rise in the form of Rey, a 19 year-old girl and a Force-sensitive scavenger from Jakku; Finn, a stormtrooper who defected from the First Order; and Poe Dameron, the best pilot in the Resistance. They are aided by Han Solo in their search for Skywalker and their mission to destroy the First Order's new superweapon, Starkiller Base, which targets the New Republic and the Resistance for destruction. They are opposed by villains such as Kylo Ren, a dark warrior with a mysterious past; and General Armitage Hux, the commander of Starkiller Base.",
    "8": "Star Wars: Episode VIII The Last Jedi, marketed as Star Wars: The Last Jedi, is a 2017 film written and directed by Rian Johnson and produced by Kathleen Kennedy and Ram Bergman, along with executive producer J.J. Abrams. It is the second part of the Star Wars sequel trilogy. The film sees the return of Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Lupita Nyong'o, Domhnall Gleeson, Anthony Daniels, Gwendoline Christie, and Andy Serkis. New cast members include Benicio Del Toro, Laura Dern, and Kelly Marie Tran. The Last Jedi begins immediately after the events of Star Wars: Episode VII The Force Awakens, set thirty years after the conclusion of the original Star Wars trilogy. It continues the story of Rey and her discovery of the exiled Jedi Master Luke Skywalker, along with the story of the war between General Leia Organa's Resistance and the First Order.",
    "9": "Star Wars: Episode IX The Rise of Skywalker, marketed as Star Wars: The Rise of Skywalker, is a 2019 film directed by J.J. Abrams from a script by Abrams and Chris Terrio. It is the third and final part of the Star Wars sequel trilogy. The film, produced by Lucasfilm president Kathleen Kennedy, is a continuation of 2015's The Force Awakens, which Abrams also directed and co-wrote, and 2017's The Last Jedi. Lucasfilm has referred to The Rise of Skywalker as the ninth and final installment of the Skywalker saga. The film stars Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, with Ian McDiarmid and Billy Dee Williams. Fisher, who passed away in 2016 prior to the film's production, appeared via unused footage from The Force Awakens. The film was first announced after The Walt Disney Company acquired Lucasfilm Ltd. in 2012. Colin Trevorrow was initially announced as the director and writer of the film, but he and Lucasfilm parted ways in September 2017, with Lucasfilm citing creative differences over the project. On September 12, 2017, Abrams and Terrio were announced as the new director and writers.",
    "10": "",
    "11": "",
    "12": "",
    "13": "",
    "14": "",
    "15": "",
    "16": "Star Wars: Clone Wars is an animated television micro-series that chronicles the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Produced by Cartoon Network Studios, the series originally aired from 2003 to 2005, and was intended to serve as a bridge between the films Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith. The series consists of twenty-five chapters; Seasons 1 and 2 (Volume I) are made up of three-minute installments, while Season 3 (Volume II) is made up of twelve-to-fifteen minute installments. The success of Star Wars: Clone Wars led to production of the similarly titled Star Wars: The Clone Wars.",
    "17": "",
    "18": "",
    "19": "",
    "20": "",
    "21": "",
    "22": "",
    "23": "",
    "24": "",
    "25": "",
    "26": "",
    "27": "",
    "28": "",
    "29": "",
    "30": "",
    "31": "",
    "32": "",
    "33": "",
    "34": "",
    "35": "",
    "36": "",
    "37": "",
    "38": "",
    "39": "",
    "40": "",
    "41": "",
    "42": "",
    "43": ""
  }