{
    "0": "The Battle of Yavin, also known as the Battle of the Death Star or the Miracle of Yavin, was a major and decisive battle of the Galactic Civil War, in which the Rebel Alliance was able to destroy the Death Star and was seen as one of the first major victories over the Galactic Empire.",
    "1": "",
    "2": "",
    "3": "",
    "4": "",
    "5": "",
    "6": "",
    "7": "",
    "8": "",
    "9": "",
    "10": "The fall of the Galactic Republic, marking the end of its era.",
    "11": "The formal establishment of the Galactic Empire by Emperor Palpatine.",
    "12": "",
    "13": "The Clone Wars was a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems, which had seceded from the Republic. Also referred to as the Clone War, it was named after the clone troopers used by the Grand Army of the Republic against the Separatist Droid Army. Due to the high volume of battle droids deployed in the conflict, the war would also be known as the Droid War. Furthermore, the existence of the Confederacy granted the conflict yet another name, the Separatist War. With both clones and droids being fielded in enormous numbers by each respective side, they were the largest military forces in galactic history, and fighting between them swept through the galaxy for three, nearly four, years.",
    "14": "The New Sith Wars, also known to the Sith as The War of the Fittest, The Betrayal, and The Curse of Qalydon, was the name given to the thousand years of conflict between the Jedi and the New Sith, which lasted from approximately 2000 to 1000 BBY. As an era, the New Sith Wars were characterized by a spectacular rise of the Sith, the decline of the Galactic Republic, and a growing militancy in the Jedi Order. The balance between the Sith and the Republic fluctuated during the period, and at several periods, especially after the pivotal Battle of Mizra, the Republic was in danger of being overwhelmed completely.",
    "15": "The Battle of Exegol, also known as the raid on Exegol or the Sith Eternal uprising, was the decisive final battle in the war between the First Order and the Resistance in which the Resistance and the Citizens' Fleet defeated the Final Order, the Xyston-class Star Destroyer fleet built by the Sith Eternal. The Resistance's victory prevented the Star Destroyers from leaving Exegol to reinforce First Order forces and began an uprising against it across the galaxy. The battle was also the final battle of the ancient, millennia-long war between the Jedi and the Sith, ending in a decisive victory for the Jedi with the destruction of Darth Sidious and prevention of the Sith's return as a whole.",
    "16": "This is item 7's description.",
    "34": "Possibly the first hyperdrive was the hyperspace tractor beam, used by the Celestials in 1,000,000 BBY. This early hyperdrive demanded massive amounts of power, supplied by gravity wells, although this type of hyperdrive was rendered obsolete by hypergates, which functioned on similar principles.",
    "35": "Though the Columi developed interstellar travel nearly 100,000 years before the Battle of Yavin, it is not known if they developed a true hyperdrive; what is known is that the fragile race soon gave up their interstellar travels to focus on other scientific and mental pursuits.",
    "36": "The Force-drive, also known as Force-based hyperdrive or Rakatan hyperdrive, was a type of hyperspace drive used in the skipships of the Rakatan Infinite Empire. As its name suggested, the Force-drive was powered by the Force energies of sentient species and was only capable of transit to worlds with strong Force signatures."
  }